espressif/esp-idf/components/soc/esp32h2/register/soc/extmem_reg.h
#define CACHE_L1_CACHE_PRELOCK_SCT1_ADDR_REG          (DR_REG_CACHE_BASE + 0x80)
/* CACHE_L1_CACHE_PRELOCK_SCT1_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the second section
 of prelock on L1-Cache, which should be used together with L1_CACHE_PRELOCK_SCT
1_SIZE_REG.*/
#define CACHE_L1_CACHE_PRELOCK_SCT1_ADDR    0xFFFFFFFF
#define CACHE_L1_CACHE_PRELOCK_SCT1_ADDR_M  ((CACHE_L1_CACHE_PRELOCK_SCT1_ADDR_V)<<(CACHE_L1_CACHE_PRELOCK_SCT1_ADDR_S))
#define CACHE_L1_CACHE_PRELOCK_SCT1_ADDR_V  0xFFFFFFFF
#define CACHE_L1_CACHE_PRELOCK_SCT1_ADDR_S  0

#define CACHE_L1_CACHE_PRELOCK_SCT_SIZE_REG          (DR_REG_CACHE_BASE + 0x84)
/* CACHE_L1_CACHE_PRELOCK_SCT1_SIZE : R/W ;bitpos:[29:16] ;default: 14'h3fff ; */
/*description: Those bits are used to configure the size of the second section of prelock on L1
-Cache, which should be used together with L1_CACHE_PRELOCK_SCT1_ADDR_REG.*/
#define CACHE_L1_CACHE_PRELOCK_SCT1_SIZE    0x00003FFF
#define CACHE_L1_CACHE_PRELOCK_SCT1_SIZE_M  ((CACHE_L1_CACHE_PRELOCK_SCT1_SIZE_V)<<(CACHE_L1_CACHE_PRELOCK_SCT1_SIZE_S))
#define CACHE_L1_CACHE_PRELOCK_SCT1_SIZE_V  0x3FFF
#define CACHE_L1_CACHE_PRELOCK_SCT1_SIZE_S  16
/* CACHE_L1_CACHE_PRELOCK_SCT0_SIZE : R/W ;bitpos:[13:0] ;default: 14'h3fff ; */
/*description: Those bits are used to configure the size of the first section of prelock on L1-
Cache, which should be used together with L1_CACHE_PRELOCK_SCT0_ADDR_REG.*/
#define CACHE_L1_CACHE_PRELOCK_SCT0_SIZE    0x00003FFF
#define CACHE_L1_CACHE_PRELOCK_SCT0_SIZE_M  ((CACHE_L1_CACHE_PRELOCK_SCT0_SIZE_V)<<(CACHE_L1_CACHE_PRELOCK_SCT0_SIZE_S))
#define CACHE_L1_CACHE_PRELOCK_SCT0_SIZE_V  0x3FFF
#define CACHE_L1_CACHE_PRELOCK_SCT0_SIZE_S  0

#define CACHE_LOCK_CTRL_REG          (DR_REG_CACHE_BASE + 0x88)
/* CACHE_LOCK_DONE : RO ;bitpos:[2] ;default: 1'h1 ; */
/*description: The bit is used to indicate whether unlock/lock operation is finished or not. 0:
 not finished. 1: finished..*/
#define CACHE_LOCK_DONE    (BIT(2))
#define CACHE_LOCK_DONE_M  (BIT(2))
#define CACHE_LOCK_DONE_V  0x1
#define CACHE_LOCK_DONE_S  2
/* CACHE_UNLOCK_ENA : R/W/SC ;bitpos:[1] ;default: 1'h0 ; */
/*description: The bit is used to enable unlock operation. It will be cleared by hardware after
 unlock operation done.*/
#define CACHE_UNLOCK_ENA    (BIT(1))
#define CACHE_UNLOCK_ENA_M  (BIT(1))
#define CACHE_UNLOCK_ENA_V  0x1
#define CACHE_UNLOCK_ENA_S  1
/* CACHE_LOCK_ENA : R/W/SC ;bitpos:[0] ;default: 1'h0 ; */
/*description: The bit is used to enable lock operation. It will be cleared by hardware after l
ock operation done.*/
#define CACHE_LOCK_ENA    (BIT(0))
#define CACHE_LOCK_ENA_M  (BIT(0))
#define CACHE_LOCK_ENA_V  0x1
#define CACHE_LOCK_ENA_S  0

#define CACHE_LOCK_MAP_REG          (DR_REG_CACHE_BASE + 0x8C)
/* CACHE_LOCK_MAP : R/W ;bitpos:[5:0] ;default: 6'h0 ; */
/*description: Those bits are used to indicate which caches in the two-level cache structure wi
ll apply this lock/unlock operation. [4]: L1-Cache.*/
#define CACHE_LOCK_MAP    0x0000003F
#define CACHE_LOCK_MAP_M  ((CACHE_LOCK_MAP_V)<<(CACHE_LOCK_MAP_S))
#define CACHE_LOCK_MAP_V  0x3F
#define CACHE_LOCK_MAP_S  0

#define CACHE_LOCK_ADDR_REG          (DR_REG_CACHE_BASE + 0x90)
/* CACHE_LOCK_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the lock/unlock op
eration, which should be used together with CACHE_LOCK_SIZE_REG.*/
#define CACHE_LOCK_ADDR    0xFFFFFFFF
#define CACHE_LOCK_ADDR_M  ((CACHE_LOCK_ADDR_V)<<(CACHE_LOCK_ADDR_S))
#define CACHE_LOCK_ADDR_V  0xFFFFFFFF
#define CACHE_LOCK_ADDR_S  0

#define CACHE_LOCK_SIZE_REG          (DR_REG_CACHE_BASE + 0x94)
/* CACHE_LOCK_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: Those bits are used to configure the size of the lock/unlock operation, which sh
ould be used together with CACHE_LOCK_ADDR_REG.*/
#define CACHE_LOCK_SIZE    0x0000FFFF
#define CACHE_LOCK_SIZE_M  ((CACHE_LOCK_SIZE_V)<<(CACHE_LOCK_SIZE_S))
#define CACHE_LOCK_SIZE_V  0xFFFF
#define CACHE_LOCK_SIZE_S  0

#define CACHE_SYNC_CTRL_REG          (DR_REG_CACHE_BASE + 0x98)
/* CACHE_SYNC_DONE : RO ;bitpos:[4] ;default: 1'h0 ; */
/*description: The bit is used to indicate whether sync operation (invalidate, clean, writeback
, writeback_invalidate) is finished or not. 0: not finished. 1: finished..*/
#define CACHE_SYNC_DONE    (BIT(4))
#define CACHE_SYNC_DONE_M  (BIT(4))
#define CACHE_SYNC_DONE_V  0x1
#define CACHE_SYNC_DONE_S  4
/* CACHE_WRITEBACK_INVALIDATE_ENA : R/W/SC ;bitpos:[3] ;default: 1'h0 ; */
/*description: The bit is used to enable writeback-invalidate operation. It will be cleared by
hardware after writeback-invalidate operation done. Note that this bit and the
other sync-bits (invalidate_ena, clean_ena, writeback_ena) are mutually exclusive
, that is, those bits can not be set to 1 at the same time..*/
#define CACHE_WRITEBACK_INVALIDATE_ENA    (BIT(3))
#define CACHE_WRITEBACK_INVALIDATE_ENA_M  (BIT(3))
#define CACHE_WRITEBACK_INVALIDATE_ENA_V  0x1
#define CACHE_WRITEBACK_INVALIDATE_ENA_S  3
/* CACHE_WRITEBACK_ENA : R/W/SC ;bitpos:[2] ;default: 1'h0 ; */
/*description: The bit is used to enable writeback operation. It will be cleared by hardware af
ter writeback operation done. Note that this bit and the other sync-bits (invali
date_ena, clean_ena, writeback_invalidate_ena) are mutually exclusive, that is,
those bits can not be set to 1 at the same time..*/
#define CACHE_WRITEBACK_ENA    (BIT(2))
#define CACHE_WRITEBACK_ENA_M  (BIT(2))
#define CACHE_WRITEBACK_ENA_V  0x1
#define CACHE_WRITEBACK_ENA_S  2
/* CACHE_CLEAN_ENA : R/W/SC ;bitpos:[1] ;default: 1'h0 ; */
/*description: The bit is used to enable clean operation. It will be cleared by hardware after
clean operation done. Note that this bit and the other sync-bits (invalidate_ena
, writeback_ena, writeback_invalidate_ena) are mutually exclusive, that is, those
bits can not be set to 1 at the same time..*/
#define CACHE_CLEAN_ENA    (BIT(1))
#define CACHE_CLEAN_ENA_M  (BIT(1))
#define CACHE_CLEAN_ENA_V  0x1
#define CACHE_CLEAN_ENA_S  1
/* CACHE_INVALIDATE_ENA : R/W/SC ;bitpos:[0] ;default: 1'h1 ; */
/*description: The bit is used to enable invalidate operation. It will be cleared by hardware a
after invalidate operation done. Note that this bit and the other sync-bits (clean_ena,
writeback_ena, writeback_invalidate_ena) are mutually exclusive, that is,
 those bits can not be set to 1 at the same time..*/
#define CACHE_INVALIDATE_ENA    (BIT(0))
#define CACHE_INVALIDATE_ENA_M  (BIT(0))
#define CACHE_INVALIDATE_ENA_V  0x1
#define CACHE_INVALIDATE_ENA_S  0

#define CACHE_SYNC_MAP_REG          (DR_REG_CACHE_BASE + 0x9C)
/* CACHE_SYNC_MAP : R/W ;bitpos:[5:0] ;default: 6'h3f ; */
/*description: Those bits are used to indicate which caches in the two-level cache structure wi
ll apply the sync operation.  [4]: L1-Cache.*/
#define CACHE_SYNC_MAP    0x0000003F
#define CACHE_SYNC_MAP_M  ((CACHE_SYNC_MAP_V)<<(CACHE_SYNC_MAP_S))
#define CACHE_SYNC_MAP_V  0x3F
#define CACHE_SYNC_MAP_S  0

