espressif/esp-idf/components/soc/esp32h2/register/soc/extmem_reg.h
#define CACHE_SYNC_ADDR_REG          (DR_REG_CACHE_BASE + 0xA0)
/* CACHE_SYNC_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the sync operation
, which should be used together with CACHE_SYNC_SIZE_REG.*/
#define CACHE_SYNC_ADDR    0xFFFFFFFF
#define CACHE_SYNC_ADDR_M  ((CACHE_SYNC_ADDR_V)<<(CACHE_SYNC_ADDR_S))
#define CACHE_SYNC_ADDR_V  0xFFFFFFFF
#define CACHE_SYNC_ADDR_S  0

#define CACHE_SYNC_SIZE_REG          (DR_REG_CACHE_BASE + 0xA4)
/* CACHE_SYNC_SIZE : R/W ;bitpos:[23:0] ;default: 24'h0 ; */
/*description: Those bits are used to configure the size of the sync operation, which should be
 used together with CACHE_SYNC_ADDR_REG.*/
#define CACHE_SYNC_SIZE    0x00FFFFFF
#define CACHE_SYNC_SIZE_M  ((CACHE_SYNC_SIZE_V)<<(CACHE_SYNC_SIZE_S))
#define CACHE_SYNC_SIZE_V  0xFFFFFF
#define CACHE_SYNC_SIZE_S  0

#define CACHE_L1_CACHE_PRELOAD_CTRL_REG          (DR_REG_CACHE_BASE + 0xD8)
/* CACHE_L1_CACHE_PRELOAD_RGID : HRO ;bitpos:[6:3] ;default: 4'h0 ; */
/*description: The bit is used to set  the gid of l1 cache preload..*/
#define CACHE_L1_CACHE_PRELOAD_RGID    0x0000000F
#define CACHE_L1_CACHE_PRELOAD_RGID_M  ((CACHE_L1_CACHE_PRELOAD_RGID_V)<<(CACHE_L1_CACHE_PRELOAD_RGID_S))
#define CACHE_L1_CACHE_PRELOAD_RGID_V  0xF
#define CACHE_L1_CACHE_PRELOAD_RGID_S  3
/* CACHE_L1_CACHE_PRELOAD_ORDER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: The bit is used to configure the direction of preload operation. 0: ascending, 1
: descending..*/
#define CACHE_L1_CACHE_PRELOAD_ORDER    (BIT(2))
#define CACHE_L1_CACHE_PRELOAD_ORDER_M  (BIT(2))
#define CACHE_L1_CACHE_PRELOAD_ORDER_V  0x1
#define CACHE_L1_CACHE_PRELOAD_ORDER_S  2
/* CACHE_L1_CACHE_PRELOAD_DONE : RO ;bitpos:[1] ;default: 1'h1 ; */
/*description: The bit is used to indicate whether preload operation is finished or not. 0: not
 finished. 1: finished..*/
#define CACHE_L1_CACHE_PRELOAD_DONE    (BIT(1))
#define CACHE_L1_CACHE_PRELOAD_DONE_M  (BIT(1))
#define CACHE_L1_CACHE_PRELOAD_DONE_V  0x1
#define CACHE_L1_CACHE_PRELOAD_DONE_S  1
/* CACHE_L1_CACHE_PRELOAD_ENA : R/W/SC ;bitpos:[0] ;default: 1'h0 ; */
/*description: The bit is used to enable preload operation on L1-Cache. It will be cleared by h
ardware automatically after preload operation is done..*/
#define CACHE_L1_CACHE_PRELOAD_ENA    (BIT(0))
#define CACHE_L1_CACHE_PRELOAD_ENA_M  (BIT(0))
#define CACHE_L1_CACHE_PRELOAD_ENA_V  0x1
#define CACHE_L1_CACHE_PRELOAD_ENA_S  0

#define CACHE_L1_CACHE_PRELOAD_ADDR_REG          (DR_REG_CACHE_BASE + 0xDC)
/* CACHE_L1_CACHE_PRELOAD_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of preload on L1-Cach
e, which should be used together with L1_CACHE_PRELOAD_SIZE_REG.*/
#define CACHE_L1_CACHE_PRELOAD_ADDR    0xFFFFFFFF
#define CACHE_L1_CACHE_PRELOAD_ADDR_M  ((CACHE_L1_CACHE_PRELOAD_ADDR_V)<<(CACHE_L1_CACHE_PRELOAD_ADDR_S))
#define CACHE_L1_CACHE_PRELOAD_ADDR_V  0xFFFFFFFF
#define CACHE_L1_CACHE_PRELOAD_ADDR_S  0

#define CACHE_L1_CACHE_PRELOAD_SIZE_REG          (DR_REG_CACHE_BASE + 0xE0)
/* CACHE_L1_CACHE_PRELOAD_SIZE : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: Those bits are used to configure the size of the first section of prelock on L1-
Cache, which should be used together with L1_CACHE_PRELOAD_ADDR_REG.*/
#define CACHE_L1_CACHE_PRELOAD_SIZE    0x00003FFF
#define CACHE_L1_CACHE_PRELOAD_SIZE_M  ((CACHE_L1_CACHE_PRELOAD_SIZE_V)<<(CACHE_L1_CACHE_PRELOAD_SIZE_S))
#define CACHE_L1_CACHE_PRELOAD_SIZE_V  0x3FFF
#define CACHE_L1_CACHE_PRELOAD_SIZE_S  0

#define CACHE_L1_CACHE_AUTOLOAD_CTRL_REG          (DR_REG_CACHE_BASE + 0x134)
/* CACHE_L1_CACHE_AUTOLOAD_SCT1_ENA : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: The bit is used to enable the second section for autoload operation on L1-Cache..*/
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ENA    (BIT(9))
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ENA_M  (BIT(9))
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ENA_V  0x1
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ENA_S  9
/* CACHE_L1_CACHE_AUTOLOAD_SCT0_ENA : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: The bit is used to enable the first section for autoload operation on L1-Cache..*/
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ENA    (BIT(8))
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ENA_M  (BIT(8))
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ENA_V  0x1
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ENA_S  8
/* CACHE_L1_CACHE_AUTOLOAD_TRIGGER_MODE : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: The field is used to configure trigger mode of autoload operation on L1-Cache. 0
/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger..*/
#define CACHE_L1_CACHE_AUTOLOAD_TRIGGER_MODE    0x00000003
#define CACHE_L1_CACHE_AUTOLOAD_TRIGGER_MODE_M  ((CACHE_L1_CACHE_AUTOLOAD_TRIGGER_MODE_V)<<(CACHE_L1_CACHE_AUTOLOAD_TRIGGER_MODE_S))
#define CACHE_L1_CACHE_AUTOLOAD_TRIGGER_MODE_V  0x3
#define CACHE_L1_CACHE_AUTOLOAD_TRIGGER_MODE_S  3
/* CACHE_L1_CACHE_AUTOLOAD_ORDER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: The bit is used to configure the direction of autoload operation on L1-Cache. 0:
 ascending. 1: descending..*/
#define CACHE_L1_CACHE_AUTOLOAD_ORDER    (BIT(2))
#define CACHE_L1_CACHE_AUTOLOAD_ORDER_M  (BIT(2))
#define CACHE_L1_CACHE_AUTOLOAD_ORDER_V  0x1
#define CACHE_L1_CACHE_AUTOLOAD_ORDER_S  2
/* CACHE_L1_CACHE_AUTOLOAD_DONE : RO ;bitpos:[1] ;default: 1'h1 ; */
/*description: The bit is used to indicate whether autoload operation on L1-Cache is finished o
r not. 0: not finished. 1: finished..*/
#define CACHE_L1_CACHE_AUTOLOAD_DONE    (BIT(1))
#define CACHE_L1_CACHE_AUTOLOAD_DONE_M  (BIT(1))
#define CACHE_L1_CACHE_AUTOLOAD_DONE_V  0x1
#define CACHE_L1_CACHE_AUTOLOAD_DONE_S  1
/* CACHE_L1_CACHE_AUTOLOAD_ENA : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: The bit is used to enable and disable autoload operation on L1-Cache.  1: enable
, 0: disable..*/
#define CACHE_L1_CACHE_AUTOLOAD_ENA    (BIT(0))
#define CACHE_L1_CACHE_AUTOLOAD_ENA_M  (BIT(0))
#define CACHE_L1_CACHE_AUTOLOAD_ENA_V  0x1
#define CACHE_L1_CACHE_AUTOLOAD_ENA_S  0

#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_REG          (DR_REG_CACHE_BASE + 0x138)
/* CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the first section
for autoload operation on L1-Cache. Note that it should be used together with L1
_CACHE_AUTOLOAD_SCT0_SIZE and L1_CACHE_AUTOLOAD_SCT0_ENA..*/
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR    0xFFFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_M  ((CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_V)<<(CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_S))
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_S  0

#define CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_REG          (DR_REG_CACHE_BASE + 0x13C)
/* CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE : R/W ;bitpos:[23:0] ;default: 24'h0 ; */
/*description: Those bits are used to configure the size of the first section for autoload oper
ation on L1-Cache. Note that it should be used together with L1_CACHE_AUTOLOAD_S
CT0_ADDR and L1_CACHE_AUTOLOAD_SCT0_ENA..*/
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE    0x00FFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_M  ((CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_V)<<(CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_S))
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_V  0xFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_S  0

#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_REG          (DR_REG_CACHE_BASE + 0x140)
/* CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the second section
 for autoload operation on L1-Cache. Note that it should be used together with L
1_CACHE_AUTOLOAD_SCT1_SIZE and L1_CACHE_AUTOLOAD_SCT1_ENA..*/
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR    0xFFFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_M  ((CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_V)<<(CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_S))
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_V  0xFFFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_S  0

#define CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_REG          (DR_REG_CACHE_BASE + 0x144)
/* CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE : R/W ;bitpos:[23:0] ;default: 24'h0 ; */
/*description: Those bits are used to configure the size of the second section for autoload ope
ration on L1-Cache. Note that it should be used together with L1_CACHE_AUTOLOAD_
SCT1_ADDR and L1_CACHE_AUTOLOAD_SCT1_ENA..*/
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE    0x00FFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_M  ((CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_V)<<(CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_S))
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_V  0xFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_S  0

#define CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_REG          (DR_REG_CACHE_BASE + 0x148)
/* CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR : HRO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the third section
for autoload operation on L1-Cache. Note that it should be used together with L1
_CACHE_AUTOLOAD_SCT2_SIZE and L1_CACHE_AUTOLOAD_SCT2_ENA..*/
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR    0xFFFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_M  ((CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_V)<<(CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_S))
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_V  0xFFFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_S  0

