espressif/esp-idf/components/soc/esp32h2/register/soc/extmem_reg.h
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_REG          (DR_REG_CACHE_BASE + 0x14C)
/* CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE : HRO ;bitpos:[23:0] ;default: 24'h0 ; */
/*description: Those bits are used to configure the size of the third section for autoload oper
ation on L1-Cache. Note that it should be used together with L1_CACHE_AUTOLOAD_S
CT2_ADDR and L1_CACHE_AUTOLOAD_SCT2_ENA..*/
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE    0x00FFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_M  ((CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_V)<<(CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_S))
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_V  0xFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_S  0

#define CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_REG          (DR_REG_CACHE_BASE + 0x150)
/* CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR : HRO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the fourth section
 for autoload operation on L1-Cache. Note that it should be used together with L
1_CACHE_AUTOLOAD_SCT3_SIZE and L1_CACHE_AUTOLOAD_SCT3_ENA..*/
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR    0xFFFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_M  ((CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_V)<<(CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_S))
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_V  0xFFFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_S  0

#define CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_REG          (DR_REG_CACHE_BASE + 0x154)
/* CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE : HRO ;bitpos:[23:0] ;default: 24'h0 ; */
/*description: Those bits are used to configure the size of the fourth section for autoload ope
ration on L1-Cache. Note that it should be used together with L1_CACHE_AUTOLOAD_
SCT3_ADDR and L1_CACHE_AUTOLOAD_SCT3_ENA..*/
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE    0x00FFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_M  ((CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_V)<<(CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_S))
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_V  0xFFFFFF
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_S  0

#define CACHE_L1_CACHE_ACS_CNT_INT_ENA_REG          (DR_REG_CACHE_BASE + 0x158)
/* CACHE_L1_BUS1_OVF_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of one of counters overflow that occurs in L
1-DCache due to bus1 accesses L1-DCache..*/
#define CACHE_L1_BUS1_OVF_INT_ENA    (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_ENA_M  (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_ENA_V  0x1
#define CACHE_L1_BUS1_OVF_INT_ENA_S  5
/* CACHE_L1_BUS0_OVF_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of one of counters overflow that occurs in L
1-DCache due to bus0 accesses L1-DCache..*/
#define CACHE_L1_BUS0_OVF_INT_ENA    (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_ENA_M  (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_ENA_V  0x1
#define CACHE_L1_BUS0_OVF_INT_ENA_S  4

#define CACHE_L1_CACHE_ACS_CNT_INT_CLR_REG          (DR_REG_CACHE_BASE + 0x15C)
/* CACHE_L1_BUS1_OVF_INT_CLR : WT ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to clear counters overflow interrupt and counters in L1-DCache
due to bus1 accesses L1-DCache..*/
#define CACHE_L1_BUS1_OVF_INT_CLR    (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_CLR_M  (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_CLR_V  0x1
#define CACHE_L1_BUS1_OVF_INT_CLR_S  5
/* CACHE_L1_BUS0_OVF_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to clear counters overflow interrupt and counters in L1-DCache
due to bus0 accesses L1-DCache..*/
#define CACHE_L1_BUS0_OVF_INT_CLR    (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_CLR_M  (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_CLR_V  0x1
#define CACHE_L1_BUS0_OVF_INT_CLR_S  4

#define CACHE_L1_CACHE_ACS_CNT_INT_RAW_REG          (DR_REG_CACHE_BASE + 0x160)
/* CACHE_L1_BUS1_OVF_INT_RAW : R/WTC/SS ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt of one of counters overflow that occurs in L1-DCach
e due to bus1 accesses L1-DCache..*/
#define CACHE_L1_BUS1_OVF_INT_RAW    (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_RAW_M  (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_RAW_V  0x1
#define CACHE_L1_BUS1_OVF_INT_RAW_S  5
/* CACHE_L1_BUS0_OVF_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt of one of counters overflow that occurs in L1-DCach
e due to bus0 accesses L1-DCache..*/
#define CACHE_L1_BUS0_OVF_INT_RAW    (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_RAW_M  (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_RAW_V  0x1
#define CACHE_L1_BUS0_OVF_INT_RAW_S  4

#define CACHE_L1_CACHE_ACS_CNT_INT_ST_REG          (DR_REG_CACHE_BASE + 0x164)
/* CACHE_L1_BUS1_OVF_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit indicates the interrupt status of one of counters overflow that occurs i
n L1-DCache due to bus1 accesses L1-DCache..*/
#define CACHE_L1_BUS1_OVF_INT_ST    (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_ST_M  (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_ST_V  0x1
#define CACHE_L1_BUS1_OVF_INT_ST_S  5
/* CACHE_L1_BUS0_OVF_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit indicates the interrupt status of one of counters overflow that occurs i
n L1-DCache due to bus0 accesses L1-DCache..*/
#define CACHE_L1_BUS0_OVF_INT_ST    (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_ST_M  (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_ST_V  0x1
#define CACHE_L1_BUS0_OVF_INT_ST_S  4

#define CACHE_L1_CACHE_ACS_FAIL_INT_ENA_REG          (DR_REG_CACHE_BASE + 0x168)
/* CACHE_L1_CACHE_FAIL_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of access fail that occurs in L1-DCache due
to cpu accesses L1-DCache..*/
#define CACHE_L1_CACHE_FAIL_INT_ENA    (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_ENA_M  (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_ENA_V  0x1
#define CACHE_L1_CACHE_FAIL_INT_ENA_S  4

#define CACHE_L1_CACHE_ACS_FAIL_INT_CLR_REG          (DR_REG_CACHE_BASE + 0x16C)
/* CACHE_L1_CACHE_FAIL_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt of access fail that occurs in L1-DCache due t
o cpu accesses L1-DCache..*/
#define CACHE_L1_CACHE_FAIL_INT_CLR    (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_CLR_M  (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_CLR_V  0x1
#define CACHE_L1_CACHE_FAIL_INT_CLR_S  4

#define CACHE_L1_CACHE_ACS_FAIL_INT_RAW_REG          (DR_REG_CACHE_BASE + 0x170)
/* CACHE_L1_CACHE_FAIL_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt of access fail that occurs in L1-DCache..*/
#define CACHE_L1_CACHE_FAIL_INT_RAW    (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_RAW_M  (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_RAW_V  0x1
#define CACHE_L1_CACHE_FAIL_INT_RAW_S  4

