espressif/esp-idf/components/soc/esp32h2/register/soc/extmem_reg.h
#define CACHE_L1_CACHE_ACS_FAIL_INT_ST_REG          (DR_REG_CACHE_BASE + 0x174)
/* CACHE_L1_CACHE_FAIL_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit indicates the interrupt status of access fail that occurs in L1-DCache
due to cpu accesses L1-DCache..*/
#define CACHE_L1_CACHE_FAIL_INT_ST    (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_ST_M  (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_ST_V  0x1
#define CACHE_L1_CACHE_FAIL_INT_ST_S  4

#define CACHE_L1_CACHE_ACS_CNT_CTRL_REG          (DR_REG_CACHE_BASE + 0x178)
/* CACHE_L1_BUS1_CNT_CLR : WT ;bitpos:[21] ;default: 1'b0 ; */
/*description: The bit is used to clear dbus1 counter in L1-DCache..*/
#define CACHE_L1_BUS1_CNT_CLR    (BIT(21))
#define CACHE_L1_BUS1_CNT_CLR_M  (BIT(21))
#define CACHE_L1_BUS1_CNT_CLR_V  0x1
#define CACHE_L1_BUS1_CNT_CLR_S  21
/* CACHE_L1_BUS0_CNT_CLR : WT ;bitpos:[20] ;default: 1'b0 ; */
/*description: The bit is used to clear dbus0 counter in L1-DCache..*/
#define CACHE_L1_BUS0_CNT_CLR    (BIT(20))
#define CACHE_L1_BUS0_CNT_CLR_M  (BIT(20))
#define CACHE_L1_BUS0_CNT_CLR_V  0x1
#define CACHE_L1_BUS0_CNT_CLR_S  20
/* CACHE_L1_BUS1_CNT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to enable dbus1 counter in L1-DCache..*/
#define CACHE_L1_BUS1_CNT_ENA    (BIT(5))
#define CACHE_L1_BUS1_CNT_ENA_M  (BIT(5))
#define CACHE_L1_BUS1_CNT_ENA_V  0x1
#define CACHE_L1_BUS1_CNT_ENA_S  5
/* CACHE_L1_BUS0_CNT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable dbus0 counter in L1-DCache..*/
#define CACHE_L1_BUS0_CNT_ENA    (BIT(4))
#define CACHE_L1_BUS0_CNT_ENA_M  (BIT(4))
#define CACHE_L1_BUS0_CNT_ENA_V  0x1
#define CACHE_L1_BUS0_CNT_ENA_S  4

#define CACHE_L1_BUS0_ACS_HIT_CNT_REG          (DR_REG_CACHE_BASE + 0x1BC)
/* CACHE_L1_BUS0_HIT_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of hits when bus0 accesses L1-Cache..*/
#define CACHE_L1_BUS0_HIT_CNT    0xFFFFFFFF
#define CACHE_L1_BUS0_HIT_CNT_M  ((CACHE_L1_BUS0_HIT_CNT_V)<<(CACHE_L1_BUS0_HIT_CNT_S))
#define CACHE_L1_BUS0_HIT_CNT_V  0xFFFFFFFF
#define CACHE_L1_BUS0_HIT_CNT_S  0

#define CACHE_L1_BUS0_ACS_MISS_CNT_REG          (DR_REG_CACHE_BASE + 0x1C0)
/* CACHE_L1_BUS0_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of missing when bus0 accesses L1-Cache..*/
#define CACHE_L1_BUS0_MISS_CNT    0xFFFFFFFF
#define CACHE_L1_BUS0_MISS_CNT_M  ((CACHE_L1_BUS0_MISS_CNT_V)<<(CACHE_L1_BUS0_MISS_CNT_S))
#define CACHE_L1_BUS0_MISS_CNT_V  0xFFFFFFFF
#define CACHE_L1_BUS0_MISS_CNT_S  0

#define CACHE_L1_BUS0_ACS_CONFLICT_CNT_REG          (DR_REG_CACHE_BASE + 0x1C4)
/* CACHE_L1_BUS0_CONFLICT_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of access-conflicts when bus0 accesses L1-Cache..*/
#define CACHE_L1_BUS0_CONFLICT_CNT    0xFFFFFFFF
#define CACHE_L1_BUS0_CONFLICT_CNT_M  ((CACHE_L1_BUS0_CONFLICT_CNT_V)<<(CACHE_L1_BUS0_CONFLICT_CNT_S))
#define CACHE_L1_BUS0_CONFLICT_CNT_V  0xFFFFFFFF
#define CACHE_L1_BUS0_CONFLICT_CNT_S  0

#define CACHE_L1_BUS0_ACS_NXTLVL_CNT_REG          (DR_REG_CACHE_BASE + 0x1C8)
/* CACHE_L1_BUS0_NXTLVL_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of times that L1-Cache accesses L2-Cache due to
bus0 accessing L1-Cache..*/
#define CACHE_L1_BUS0_NXTLVL_CNT    0xFFFFFFFF
#define CACHE_L1_BUS0_NXTLVL_CNT_M  ((CACHE_L1_BUS0_NXTLVL_CNT_V)<<(CACHE_L1_BUS0_NXTLVL_CNT_S))
#define CACHE_L1_BUS0_NXTLVL_CNT_V  0xFFFFFFFF
#define CACHE_L1_BUS0_NXTLVL_CNT_S  0

#define CACHE_L1_BUS1_ACS_HIT_CNT_REG          (DR_REG_CACHE_BASE + 0x1CC)
/* CACHE_L1_BUS1_HIT_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of hits when bus1 accesses L1-Cache..*/
#define CACHE_L1_BUS1_HIT_CNT    0xFFFFFFFF
#define CACHE_L1_BUS1_HIT_CNT_M  ((CACHE_L1_BUS1_HIT_CNT_V)<<(CACHE_L1_BUS1_HIT_CNT_S))
#define CACHE_L1_BUS1_HIT_CNT_V  0xFFFFFFFF
#define CACHE_L1_BUS1_HIT_CNT_S  0

#define CACHE_L1_BUS1_ACS_MISS_CNT_REG          (DR_REG_CACHE_BASE + 0x1D0)
/* CACHE_L1_BUS1_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of missing when bus1 accesses L1-Cache..*/
#define CACHE_L1_BUS1_MISS_CNT    0xFFFFFFFF
#define CACHE_L1_BUS1_MISS_CNT_M  ((CACHE_L1_BUS1_MISS_CNT_V)<<(CACHE_L1_BUS1_MISS_CNT_S))
#define CACHE_L1_BUS1_MISS_CNT_V  0xFFFFFFFF
#define CACHE_L1_BUS1_MISS_CNT_S  0

#define CACHE_L1_BUS1_ACS_CONFLICT_CNT_REG          (DR_REG_CACHE_BASE + 0x1D4)
/* CACHE_L1_BUS1_CONFLICT_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of access-conflicts when bus1 accesses L1-Cache..*/
#define CACHE_L1_BUS1_CONFLICT_CNT    0xFFFFFFFF
#define CACHE_L1_BUS1_CONFLICT_CNT_M  ((CACHE_L1_BUS1_CONFLICT_CNT_V)<<(CACHE_L1_BUS1_CONFLICT_CNT_S))
#define CACHE_L1_BUS1_CONFLICT_CNT_V  0xFFFFFFFF
#define CACHE_L1_BUS1_CONFLICT_CNT_S  0

#define CACHE_L1_BUS1_ACS_NXTLVL_CNT_REG          (DR_REG_CACHE_BASE + 0x1D8)
/* CACHE_L1_BUS1_NXTLVL_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of times that L1-Cache accesses L2-Cache due to
bus1 accessing L1-Cache..*/
#define CACHE_L1_BUS1_NXTLVL_CNT    0xFFFFFFFF
#define CACHE_L1_BUS1_NXTLVL_CNT_M  ((CACHE_L1_BUS1_NXTLVL_CNT_V)<<(CACHE_L1_BUS1_NXTLVL_CNT_S))
#define CACHE_L1_BUS1_NXTLVL_CNT_V  0xFFFFFFFF
#define CACHE_L1_BUS1_NXTLVL_CNT_S  0

#define CACHE_L1_CACHE_ACS_FAIL_ID_ATTR_REG          (DR_REG_CACHE_BASE + 0x21C)
/* CACHE_L1_CACHE_FAIL_ATTR : RO ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: The register records the attribution of fail-access when cache accesses L1-Cache
..*/
#define CACHE_L1_CACHE_FAIL_ATTR    0x0000FFFF
#define CACHE_L1_CACHE_FAIL_ATTR_M  ((CACHE_L1_CACHE_FAIL_ATTR_V)<<(CACHE_L1_CACHE_FAIL_ATTR_S))
#define CACHE_L1_CACHE_FAIL_ATTR_V  0xFFFF
#define CACHE_L1_CACHE_FAIL_ATTR_S  16
/* CACHE_L1_CACHE_FAIL_ID : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The register records the ID of fail-access when cache accesses L1-Cache..*/
#define CACHE_L1_CACHE_FAIL_ID    0x0000FFFF
#define CACHE_L1_CACHE_FAIL_ID_M  ((CACHE_L1_CACHE_FAIL_ID_V)<<(CACHE_L1_CACHE_FAIL_ID_S))
#define CACHE_L1_CACHE_FAIL_ID_V  0xFFFF
#define CACHE_L1_CACHE_FAIL_ID_S  0

