espressif/esp-idf/components/soc/esp32h2/register/soc/extmem_reg.h
#define CACHE_L1_CACHE_ACS_FAIL_ADDR_REG          (DR_REG_CACHE_BASE + 0x220)
/* CACHE_L1_CACHE_FAIL_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the address of fail-access when cache accesses L1-Cache..*/
#define CACHE_L1_CACHE_FAIL_ADDR    0xFFFFFFFF
#define CACHE_L1_CACHE_FAIL_ADDR_M  ((CACHE_L1_CACHE_FAIL_ADDR_V)<<(CACHE_L1_CACHE_FAIL_ADDR_S))
#define CACHE_L1_CACHE_FAIL_ADDR_V  0xFFFFFFFF
#define CACHE_L1_CACHE_FAIL_ADDR_S  0

#define CACHE_L1_CACHE_SYNC_PRELOAD_INT_ENA_REG          (DR_REG_CACHE_BASE + 0x224)
/* CACHE_SYNC_ERR_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of Cache sync-operation error..*/
#define CACHE_SYNC_ERR_INT_ENA    (BIT(13))
#define CACHE_SYNC_ERR_INT_ENA_M  (BIT(13))
#define CACHE_SYNC_ERR_INT_ENA_V  0x1
#define CACHE_SYNC_ERR_INT_ENA_S  13
/* CACHE_L1_CACHE_PLD_ERR_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of L1-Cache preload-operation error..*/
#define CACHE_L1_CACHE_PLD_ERR_INT_ENA    (BIT(11))
#define CACHE_L1_CACHE_PLD_ERR_INT_ENA_M  (BIT(11))
#define CACHE_L1_CACHE_PLD_ERR_INT_ENA_V  0x1
#define CACHE_L1_CACHE_PLD_ERR_INT_ENA_S  11
/* CACHE_SYNC_DONE_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of Cache sync-operation done..*/
#define CACHE_SYNC_DONE_INT_ENA    (BIT(6))
#define CACHE_SYNC_DONE_INT_ENA_M  (BIT(6))
#define CACHE_SYNC_DONE_INT_ENA_V  0x1
#define CACHE_SYNC_DONE_INT_ENA_S  6
/* CACHE_L1_CACHE_PLD_DONE_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of L1-Cache preload-operation. If preload op
eration is done, interrupt occurs..*/
#define CACHE_L1_CACHE_PLD_DONE_INT_ENA    (BIT(4))
#define CACHE_L1_CACHE_PLD_DONE_INT_ENA_M  (BIT(4))
#define CACHE_L1_CACHE_PLD_DONE_INT_ENA_V  0x1
#define CACHE_L1_CACHE_PLD_DONE_INT_ENA_S  4

#define CACHE_L1_CACHE_SYNC_PRELOAD_INT_CLR_REG          (DR_REG_CACHE_BASE + 0x228)
/* CACHE_SYNC_ERR_INT_CLR : WT ;bitpos:[13] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt of Cache sync-operation error..*/
#define CACHE_SYNC_ERR_INT_CLR    (BIT(13))
#define CACHE_SYNC_ERR_INT_CLR_M  (BIT(13))
#define CACHE_SYNC_ERR_INT_CLR_V  0x1
#define CACHE_SYNC_ERR_INT_CLR_S  13
/* CACHE_L1_CACHE_PLD_ERR_INT_CLR : WT ;bitpos:[11] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt of L1-Cache preload-operation error..*/
#define CACHE_L1_CACHE_PLD_ERR_INT_CLR    (BIT(11))
#define CACHE_L1_CACHE_PLD_ERR_INT_CLR_M  (BIT(11))
#define CACHE_L1_CACHE_PLD_ERR_INT_CLR_V  0x1
#define CACHE_L1_CACHE_PLD_ERR_INT_CLR_S  11
/* CACHE_SYNC_DONE_INT_CLR : WT ;bitpos:[6] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt that occurs only when Cache sync-operation is
 done..*/
#define CACHE_SYNC_DONE_INT_CLR    (BIT(6))
#define CACHE_SYNC_DONE_INT_CLR_M  (BIT(6))
#define CACHE_SYNC_DONE_INT_CLR_V  0x1
#define CACHE_SYNC_DONE_INT_CLR_S  6
/* CACHE_L1_CACHE_PLD_DONE_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt that occurs only when L1-Cache preload-operat
ion is done..*/
#define CACHE_L1_CACHE_PLD_DONE_INT_CLR    (BIT(4))
#define CACHE_L1_CACHE_PLD_DONE_INT_CLR_M  (BIT(4))
#define CACHE_L1_CACHE_PLD_DONE_INT_CLR_V  0x1
#define CACHE_L1_CACHE_PLD_DONE_INT_CLR_S  4

#define CACHE_L1_CACHE_SYNC_PRELOAD_INT_RAW_REG          (DR_REG_CACHE_BASE + 0x22C)
/* CACHE_SYNC_ERR_INT_RAW : R/WTC/SS ;bitpos:[13] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt that occurs only when Cache sync-operation error oc
curs..*/
#define CACHE_SYNC_ERR_INT_RAW    (BIT(13))
#define CACHE_SYNC_ERR_INT_RAW_M  (BIT(13))
#define CACHE_SYNC_ERR_INT_RAW_V  0x1
#define CACHE_SYNC_ERR_INT_RAW_S  13
/* CACHE_L1_CACHE_PLD_ERR_INT_RAW : R/WTC/SS ;bitpos:[11] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt that occurs only when L1-Cache preload-operation er
ror occurs..*/
#define CACHE_L1_CACHE_PLD_ERR_INT_RAW    (BIT(11))
#define CACHE_L1_CACHE_PLD_ERR_INT_RAW_M  (BIT(11))
#define CACHE_L1_CACHE_PLD_ERR_INT_RAW_V  0x1
#define CACHE_L1_CACHE_PLD_ERR_INT_RAW_S  11
/* CACHE_SYNC_DONE_INT_RAW : R/WTC/SS ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt that occurs only when Cache sync-operation is done..*/
#define CACHE_SYNC_DONE_INT_RAW    (BIT(6))
#define CACHE_SYNC_DONE_INT_RAW_M  (BIT(6))
#define CACHE_SYNC_DONE_INT_RAW_V  0x1
#define CACHE_SYNC_DONE_INT_RAW_S  6
/* CACHE_L1_CACHE_PLD_DONE_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt that occurs only when L1-Cache preload-operation is
 done..*/
#define CACHE_L1_CACHE_PLD_DONE_INT_RAW    (BIT(4))
#define CACHE_L1_CACHE_PLD_DONE_INT_RAW_M  (BIT(4))
#define CACHE_L1_CACHE_PLD_DONE_INT_RAW_V  0x1
#define CACHE_L1_CACHE_PLD_DONE_INT_RAW_S  4

#define CACHE_L1_CACHE_SYNC_PRELOAD_INT_ST_REG          (DR_REG_CACHE_BASE + 0x230)
/* CACHE_SYNC_ERR_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The bit indicates the status of the interrupt of Cache sync-operation error..*/
#define CACHE_SYNC_ERR_INT_ST    (BIT(13))
#define CACHE_SYNC_ERR_INT_ST_M  (BIT(13))
#define CACHE_SYNC_ERR_INT_ST_V  0x1
#define CACHE_SYNC_ERR_INT_ST_S  13
/* CACHE_L1_CACHE_PLD_ERR_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: The bit indicates the status of the interrupt of L1-Cache preload-operation error
r..*/
#define CACHE_L1_CACHE_PLD_ERR_INT_ST    (BIT(11))
#define CACHE_L1_CACHE_PLD_ERR_INT_ST_M  (BIT(11))
#define CACHE_L1_CACHE_PLD_ERR_INT_ST_V  0x1
#define CACHE_L1_CACHE_PLD_ERR_INT_ST_S  11
/* CACHE_SYNC_DONE_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The bit indicates the status of the interrupt that occurs only when Cache sync-o
peration is done..*/
#define CACHE_SYNC_DONE_INT_ST    (BIT(6))
#define CACHE_SYNC_DONE_INT_ST_M  (BIT(6))
#define CACHE_SYNC_DONE_INT_ST_V  0x1
#define CACHE_SYNC_DONE_INT_ST_S  6
/* CACHE_L1_CACHE_PLD_DONE_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit indicates the status of the interrupt that occurs only when L1-Cache pre
load-operation is done..*/
#define CACHE_L1_CACHE_PLD_DONE_INT_ST    (BIT(4))
#define CACHE_L1_CACHE_PLD_DONE_INT_ST_M  (BIT(4))
#define CACHE_L1_CACHE_PLD_DONE_INT_ST_V  0x1
#define CACHE_L1_CACHE_PLD_DONE_INT_ST_S  4

#define CACHE_L1_CACHE_SYNC_PRELOAD_EXCEPTION_REG          (DR_REG_CACHE_BASE + 0x234)
/* CACHE_SYNC_ERR_CODE : RO ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: The values 0-2 are available which means sync map, command conflict and size are
 error in Cache System..*/
#define CACHE_SYNC_ERR_CODE    0x00000003
#define CACHE_SYNC_ERR_CODE_M  ((CACHE_SYNC_ERR_CODE_V)<<(CACHE_SYNC_ERR_CODE_S))
#define CACHE_SYNC_ERR_CODE_V  0x3
#define CACHE_SYNC_ERR_CODE_S  12
/* CACHE_L1_CACHE_PLD_ERR_CODE : RO ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: The value 2 is Only available which means preload size is error in L1-Cache..*/
#define CACHE_L1_CACHE_PLD_ERR_CODE    0x00000003
#define CACHE_L1_CACHE_PLD_ERR_CODE_M  ((CACHE_L1_CACHE_PLD_ERR_CODE_V)<<(CACHE_L1_CACHE_PLD_ERR_CODE_S))
#define CACHE_L1_CACHE_PLD_ERR_CODE_V  0x3
#define CACHE_L1_CACHE_PLD_ERR_CODE_S  8

#define CACHE_L1_CACHE_SYNC_RST_CTRL_REG          (DR_REG_CACHE_BASE + 0x238)
/* CACHE_L1_CACHE_SYNC_RST : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: set this bit to reset sync-logic inside L1-Cache. Recommend that this should only
y be used to initialize sync-logic when some fatal error of sync-logic occurs..*/
#define CACHE_L1_CACHE_SYNC_RST    (BIT(4))
#define CACHE_L1_CACHE_SYNC_RST_M  (BIT(4))
#define CACHE_L1_CACHE_SYNC_RST_V  0x1
#define CACHE_L1_CACHE_SYNC_RST_S  4

#define CACHE_L1_CACHE_PRELOAD_RST_CTRL_REG          (DR_REG_CACHE_BASE + 0x23C)
/* CACHE_L1_CACHE_PLD_RST : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: set this bit to reset preload-logic inside L1-Cache. Recommend that this should
only be used to initialize preload-logic when some fatal error of preload-logic
occurs..*/
#define CACHE_L1_CACHE_PLD_RST    (BIT(4))
#define CACHE_L1_CACHE_PLD_RST_M  (BIT(4))
#define CACHE_L1_CACHE_PLD_RST_V  0x1
#define CACHE_L1_CACHE_PLD_RST_S  4

#define CACHE_L1_CACHE_AUTOLOAD_BUF_CLR_CTRL_REG          (DR_REG_CACHE_BASE + 0x240)
/* CACHE_L1_CACHE_ALD_BUF_CLR : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: set this bit to clear autoload-buffer inside L1-Cache. If this bit is active, au
toload will not work in L1-Cache. This bit should not be active when autoload wo
rks in L1-Cache..*/
#define CACHE_L1_CACHE_ALD_BUF_CLR    (BIT(4))
#define CACHE_L1_CACHE_ALD_BUF_CLR_M  (BIT(4))
#define CACHE_L1_CACHE_ALD_BUF_CLR_V  0x1
#define CACHE_L1_CACHE_ALD_BUF_CLR_S  4

#define CACHE_L1_UNALLOCATE_BUFFER_CLEAR_REG          (DR_REG_CACHE_BASE + 0x244)
/* CACHE_L1_CACHE_UNALLOC_CLR : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to clear the unallocate request buffer of l1 cache where the una
llocate request is responded but not completed..*/
#define CACHE_L1_CACHE_UNALLOC_CLR    (BIT(4))
#define CACHE_L1_CACHE_UNALLOC_CLR_M  (BIT(4))
#define CACHE_L1_CACHE_UNALLOC_CLR_V  0x1
#define CACHE_L1_CACHE_UNALLOC_CLR_S  4

