espressif/esp-idf/components/soc/esp32h2/register/soc/extmem_reg.h
#define CACHE_L1_CACHE_OBJECT_CTRL_REG          (DR_REG_CACHE_BASE + 0x248)
/* CACHE_L1_CACHE_MEM_OBJECT : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit to set L1-Cache data memory as object. This bit should be onehot wi
th the others fields inside this register..*/
#define CACHE_L1_CACHE_MEM_OBJECT    (BIT(10))
#define CACHE_L1_CACHE_MEM_OBJECT_M  (BIT(10))
#define CACHE_L1_CACHE_MEM_OBJECT_V  0x1
#define CACHE_L1_CACHE_MEM_OBJECT_S  10
/* CACHE_L1_CACHE_TAG_OBJECT : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to set L1-Cache tag memory as object. This bit should be onehot with
h the others fields inside this register..*/
#define CACHE_L1_CACHE_TAG_OBJECT    (BIT(4))
#define CACHE_L1_CACHE_TAG_OBJECT_M  (BIT(4))
#define CACHE_L1_CACHE_TAG_OBJECT_V  0x1
#define CACHE_L1_CACHE_TAG_OBJECT_S  4

#define CACHE_L1_CACHE_WAY_OBJECT_REG          (DR_REG_CACHE_BASE + 0x24C)
/* CACHE_L1_CACHE_WAY_OBJECT : R/W ;bitpos:[2:0] ;default: 3'h0 ; */
/*description: Set this bits to select which way of the tag-object will be accessed. 0: way0, 1
: way1, 2: way2, 3: way3, ?, 7: way7..*/
#define CACHE_L1_CACHE_WAY_OBJECT    0x00000007
#define CACHE_L1_CACHE_WAY_OBJECT_M  ((CACHE_L1_CACHE_WAY_OBJECT_V)<<(CACHE_L1_CACHE_WAY_OBJECT_S))
#define CACHE_L1_CACHE_WAY_OBJECT_V  0x7
#define CACHE_L1_CACHE_WAY_OBJECT_S  0

#define CACHE_L1_CACHE_VADDR_REG          (DR_REG_CACHE_BASE + 0x250)
/* CACHE_L1_CACHE_VADDR : R/W ;bitpos:[31:0] ;default: 32'h40000000 ; */
/*description: Those bits stores the virtual address which will decide where inside the specified
tag memory object will be accessed..*/
#define CACHE_L1_CACHE_VADDR    0xFFFFFFFF
#define CACHE_L1_CACHE_VADDR_M  ((CACHE_L1_CACHE_VADDR_V)<<(CACHE_L1_CACHE_VADDR_S))
#define CACHE_L1_CACHE_VADDR_V  0xFFFFFFFF
#define CACHE_L1_CACHE_VADDR_S  0

#define CACHE_L1_CACHE_DEBUG_BUS_REG          (DR_REG_CACHE_BASE + 0x254)
/* CACHE_L1_CACHE_DEBUG_BUS : R/W ;bitpos:[31:0] ;default: 32'h254 ; */
/*description: This is a constant place where we can write data to or read data from the tag/da
ta memory on the specified cache..*/
#define CACHE_L1_CACHE_DEBUG_BUS    0xFFFFFFFF
#define CACHE_L1_CACHE_DEBUG_BUS_M  ((CACHE_L1_CACHE_DEBUG_BUS_V)<<(CACHE_L1_CACHE_DEBUG_BUS_S))
#define CACHE_L1_CACHE_DEBUG_BUS_V  0xFFFFFFFF
#define CACHE_L1_CACHE_DEBUG_BUS_S  0

#define CACHE_CLOCK_GATE_REG          (DR_REG_CACHE_BASE + 0x3AC)
/* CACHE_CLK_EN : R/W ;bitpos:[0] ;default: 1'h1 ; */
/*description: The bit is used to enable clock gate when access all registers in this module..*/
#define CACHE_CLK_EN    (BIT(0))
#define CACHE_CLK_EN_M  (BIT(0))
#define CACHE_CLK_EN_V  0x1
#define CACHE_CLK_EN_S  0

#define CACHE_REDUNDANCY_SIG0_REG          (DR_REG_CACHE_BASE + 0x3B0)
/* CACHE_REDCY_SIG0 : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are prepared for ECO..*/
#define CACHE_REDCY_SIG0    0xFFFFFFFF
#define CACHE_REDCY_SIG0_M  ((CACHE_REDCY_SIG0_V)<<(CACHE_REDCY_SIG0_S))
#define CACHE_REDCY_SIG0_V  0xFFFFFFFF
#define CACHE_REDCY_SIG0_S  0

#define CACHE_REDUNDANCY_SIG1_REG          (DR_REG_CACHE_BASE + 0x3B4)
/* CACHE_REDCY_SIG1 : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are prepared for ECO..*/
#define CACHE_REDCY_SIG1    0xFFFFFFFF
#define CACHE_REDCY_SIG1_M  ((CACHE_REDCY_SIG1_V)<<(CACHE_REDCY_SIG1_S))
#define CACHE_REDCY_SIG1_V  0xFFFFFFFF
#define CACHE_REDCY_SIG1_S  0

#define CACHE_REDUNDANCY_SIG2_REG          (DR_REG_CACHE_BASE + 0x3B8)
/* CACHE_REDCY_SIG2 : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are prepared for ECO..*/
#define CACHE_REDCY_SIG2    0xFFFFFFFF
#define CACHE_REDCY_SIG2_M  ((CACHE_REDCY_SIG2_V)<<(CACHE_REDCY_SIG2_S))
#define CACHE_REDCY_SIG2_V  0xFFFFFFFF
#define CACHE_REDCY_SIG2_S  0

#define CACHE_REDUNDANCY_SIG3_REG          (DR_REG_CACHE_BASE + 0x3BC)
/* CACHE_REDCY_SIG3 : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are prepared for ECO..*/
#define CACHE_REDCY_SIG3    0xFFFFFFFF
#define CACHE_REDCY_SIG3_M  ((CACHE_REDCY_SIG3_V)<<(CACHE_REDCY_SIG3_S))
#define CACHE_REDCY_SIG3_V  0xFFFFFFFF
#define CACHE_REDCY_SIG3_S  0

#define CACHE_REDUNDANCY_SIG4_REG          (DR_REG_CACHE_BASE + 0x3C0)
/* CACHE_REDCY_SIG4 : RO ;bitpos:[3:0] ;default: 4'h0 ; */
/*description: Those bits are prepared for ECO..*/
#define CACHE_REDCY_SIG4    0x0000000F
#define CACHE_REDCY_SIG4_M  ((CACHE_REDCY_SIG4_V)<<(CACHE_REDCY_SIG4_S))
#define CACHE_REDCY_SIG4_V  0xF
#define CACHE_REDCY_SIG4_S  0

#define CACHE_DATE_REG          (DR_REG_CACHE_BASE + 0x3FC)
/* CACHE_DATE : R/W ;bitpos:[27:0] ;default: 28'h2207250 ; */
/*description: version control register. Note that this default value stored is the latest date
 when the hardware logic was updated..*/
#define CACHE_DATE    0x0FFFFFFF
#define CACHE_DATE_M  ((CACHE_DATE_V)<<(CACHE_DATE_S))
#define CACHE_DATE_V  0xFFFFFFF
#define CACHE_DATE_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_CACHE_REG_H_ */
